package org.aai.analytics.ai.keywordExtraction;

import org.junit.Test;

import java.util.List;

public class KeywordExtractionTest {

    @Test
    public void test1() {
        KeywordExtraction keyEx = KeywordExtraction.getInstance();
        String largeString = "ইসরাইলি অধিকৃত অঞ্চলে ফিলিস্তিনিদের নিরাপত্তা উন্নয়নে " +
                "চারটি বিকল্পের কথা বলেছেন জাতিসংঘের মহাসচিব অ্যান্তনিও গুয়েতেরেস। তা হল, সেখানে জাতিসংঘের মানবাধিকার " +
                "ও নিরস্ত্র পর্যবেক্ষক নিয়োগ করা। এছাড়া জাতিসংঘ নির্দেশিত একটি সামরিক কিংবা পুলিশ বাহিনী " +
                "মোতায়েন করা। গত ৩০ মার্চ শুরু হওয়া ফিলিস্তিনিদের বসতবাড়িতে ফেরার অধিকার দাবিতে " +
                "বিক্ষোভে ইসরাইলি গুলিতে ১৭১জন নিহত হয়েছেন। সেই প্রেক্ষিতে জাতিসংঘের সাধারণ পরিষদের" +
                " এক প্রতিবেদনে এ প্রস্তাবের কথা বলা হয়েছে। গুয়েতেরেস জোর দিয়ে বলেন, প্রয়োজন অনুসারে" +
                " ইসরাইল ও ফিলিস্তিনিদের সহযোগিতা নেয়া হবে। ১৪ পাতার প্রতিবেদনে গুয়েতেরেসের প্রস্তাব- " +
                "• সরেজমিনে পর্যবেক্ষণ করতে জোরালোভাবে জাতিসংঘের উপস্থিতি বাড়াতে মানবাধিকার পর্যবেক্ষক ও রাজনৈতিক" +
                " কর্মকর্তাদের নিয়োগ দেয়া। তারা পরিস্থিতি নিয়ে প্রতিবেদন পেশ করবেন। • বেসামরিক লোকজনের কল্যাণ নিশ্চিত" +
                " করতে জাতিসংঘের মানবিক ও উন্নয়ন সহায়তা বাড়ানো। • একটি বেসামরিক পর্যবেক্ষক মিশন শুরু করতে হবে। " +
                "তল্লাশি চৌকি ও ইসরাইলি বসতির মতো স্পর্শকাতর অঞ্চলগুলোতে তারা উপস্থিত থাকবেন। ফিলিস্তিনিদের সুরক্ষা বিষয়ে " +
                "তারা প্রতিবেদন দেবেন। • জাতিসংঘের ম্যান্ডেটের অধীন একটি সশস্ত্র সামরিক কিংবা পুলিশ বাহিনী মোতায়েন করা। " +
                "তারা ফিলিস্তিনি বেসামরিক লোকজনের নিরাপত্তা নিশ্চিত করবেন। এদিকে গাজা উপত্যকার সীমান্ত বরাবর শুক্রবারের" +
                " বিক্ষোভে ইসরাইলি সেনাবাহিনীর এলোপাতাড়ি গুলিতে দুই ফিলিস্তিনি নিহত হয়েছেন। ফিলিস্তিনি স্বাস্থ্য মন্ত্রণালয় এ তথ্য জানিয়েছে।" +
                " নিহতরা হলেন, ৩০ বছর বয়সী করিম আবু ফাতিয়ার ও ২৬ বছর বয়সী সাদি মোয়ামের। মধ্য গাজার বুরেইজ শহরে" +
                " ফাতিয়ার, আর সাদি রাফাহ শহরের কাছাকাছি দক্ষিণ গাজায় নিহত হন। তাদের দুজনেরই মাথায় গুলি লেগেছে। " +
                "দেশটির স্বাস্থ্য মন্ত্রণালয় জানায়, ২৭০ জনের বেশি আহত হয়েছেন। এর মধ্যে ৭০ জনই গুলিবিদ্ধ হয়েছেন। " +
                "হতাহতের ব্যাপারে ইসরাইলি সেনাবাহিনী কিছু জানে না বলে জানিয়েছে। তবে তারা বলেছে, সীমান্ত বরাবর " +
                "বিক্ষোভে তারা প্রকাশ্যে গুলি করেছে। গত ৩০ মার্চ শুরু হওয়া বিক্ষোভে ইসরাইলি গুলিতে ১৭১ জনের বেশি " +
                "ফিলিস্তিনি নিহত হয়েছেন। তাদের অধিকাংশই সীমান্ত সহিংসতায় নিহত হন। গত জুলাইয়ে একজন ইসরাইলি স্নাইপারও " +
                "নিহত হয়েছেন। এদিকে জাতিসংঘের মহাসচিব অ্যান্তনিও গুয়েতেরেস শুক্রবার বলেছেন, জাতিসংঘ নির্দেশিত সশস্ত্র " +
                "বাহিনী কিংবা নিরস্ত্র পর্যবেক্ষক মোতায়েনের মাধ্যমে ফিলিস্তিনি জনগণের সুরক্ষা ব্যবস্থা উন্নত করা যাবে। " +
                "তিনি বলেন, এতে করে সেখানে জাতিসংঘের বেসামরিক উপস্থিতি কিংবা সহায়তা বাড়ানো সম্ভব। গত জুনে " +
                "জাতিসংঘের সাধারণ পরিষদে গৃহীত হওয়া এক প্রস্তাবে ফিলিস্তিনি জনগণের বিরুদ্ধে ইসরাইলের অতিরিক্ত বলপ্রয়োগের নিন্দা জানানো হয়েছে।";

        List<String> res = keyEx.process(largeString);
        System.out.println(res.toString());
    }
}
